# Add Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternallyTaggedNonBReps..::..Add Method
ExternallyTaggedNonBReps Class See Also
---
Adds a copy of the input ExternallyTaggedNonBRep to this collection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public void Add(
	ExternallyTaggedNonBRep geometry
)
```

Visual Basic
---
```text
Public Sub Add ( _
	geometry As ExternallyTaggedNonBRep _
)
```

Visual C++
---
```text
public:
void Add(
	ExternallyTaggedNonBRep^ geometry
)
```

# ### Parameters
geometry
    Type: Autodesk.Revit.DB..::..ExternallyTaggedNonBRep The ExternallyTaggedNonBRep to be added.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The ExternalGeometryId of geometry already exists in this collection. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExternallyTaggedNonBReps Class
Autodesk.Revit.DB Namespace